<template>
  <div class="manual__text text-manual">
    <div class="text-manual__header">
      <h1 class="text-manual__title">Тема 9</h1>
      <div class="text-manual__subtitle">Функции в программировании</div>
    </div>
      <div class="text-manual__body">
        <div class="text-manual__section-block">
          <h2 id="title1" class="text-manual__section-title">Введение в функции</h2>
          <p>Функция в программировании представляет собой обособленный участок кода, который
              можно вызывать, обратившись к нему по имени, которым он был назван. При вызове
              происходит выполнение команд тела функции.</p>
          <p>Функции можно сравнить с небольшими программками, которые сами по себе, т. е.
              автономно, не исполняются, а встраиваются в обычную программу. Нередко их так и
              называют – подпрограммы. Других ключевых отличий функций от программ нет. Функции
              также при необходимости могут получать и возвращать данные. Только обычно они их
              получают не с ввода (клавиатуры, файла и др.), а из вызывающей программы. Сюда же они
              возвращают результат своей работы</p>
          <p>Существует множество встроенных в язык программирования функций. С некоторыми
              такими в Python мы уже сталкивались. Это print(), input(), int(), float(), str(), type(). Код их тела
              нам не виден, он где4то "спрятан внутри языка". Нам же предоставляется только интерфейс –
              имя функции.</p>
          <p>С другой стороны, программист всегда может определять свои функции. Их называют
              пользовательскими. В данном случае под "пользователем" понимают программиста, а не
              того, кто пользует программу. Разберемся, зачем нам эти функции, и как их создавать.</p>
          <p>Предположим, надо три раза подряд запрашивать на ввод пару чисел и складывать их. С этой
              целью можно использовать цикл:</p>
          <pre><code class="python">i = 0
while i &gt; 3:
    a = int(input())
    b = int(input())
    print(a+b)
    i += 1</code></pre>
          <p>Однако, что если перед каждым запросом чисел, надо выводить надпись, зачем они нужны, и
            каждый раз эта надпись разная. Мы не можем прервать цикл, а затем вернуться к тому же
            циклу обратно. Придется отказаться от него, и тогда получится длинный код, содержащий в
            разных местах одинаковые участки:</p>
          <pre><code class="python">print("Сколько бананов и ананасов для обезьян?")
a = int(input())
b = int(input())
print("Всего", a+b, "шт.")

print("Сколько жуков и червей для ежей?")
a = int(input())
b = int(input())
print("Всего", a+b, "шт.")

print("Сколько рыб и моллюсков для выдр?")
a = int(input())
b = int(input())
print("Всего", a+b, "шт.")</code></pre>
          <p>Пример исполнения программы:</p>
          <pre><code class="python">Сколько бананов и ананасов для обезьян?
15
5
Всего 20 шт.
Сколько жуков и червей для ежей?
50
12
Всего 62 шт.
Сколько рыб и моллюсков для выдр?
16
8
Всего 24 шт.</code></pre>
          <p>Внедрение функций позволяет решить проблему дублирования кода в разных местах
            программы. Благодаря им можно исполнять один и тот же участок кода не сразу, а только
            тогда, когда он понадобится.</p>
        </div>
        <section  class="text-manual__doc-section">
          <h2 id="title2" class="text-manual__section-title">Определение функции. Оператор def</h2>
          <div class="text-manual__section-block">
            <p>В языке программирования Python функции определяются с помощью оператора def.
              Рассмотрим код:</p>
            <pre><code class="python">def countFood():
a = int(input())
b = int(input())
print("Всего", a+b, "шт.")</code></pre>
            <p>Это пример определения функции. Как и другие сложные инструкции вроде условного
              оператора и циклов функция состоит из заголовка и тела. Заголовок оканчивается двоеточием
              и переходом на новую строку. Тело имеет отступ.</p>
            <p>Ключевое слово def сообщает интерпретатору, что перед ним определение функции. За def
              следует имя функции. Оно может быть любым, также как и всякий идентификатор, например,
              переменная. В программировании весьма желательно давать всему осмысленные имена. Так
              в данном случае функция названа "посчитатьЕду" в переводе на русский.</p>
            <p>После имени функции ставятся скобки. В приведенном примере они пустые. Это значит, что
              функция не принимает никакие данные из вызывающей ее программы. Однако она могла бы
              их принимать, и тогда в скобках были бы указаны так называемые параметры.</p>
            <p>После двоеточия следует тело, содержащее инструкции, которые выполняются при вызове
              функции. Следует различать определение функции и ее вызов. В программном коде они не
              рядом и не вместе. Можно определить функцию, но ни разу ее не вызвать. Нельзя вызвать
              функцию, которая не была определена. Определив функцию, но ни разу не вызвав ее, вы
              никогда не выполните ее тела.</p>
          </div> 
        </section>
        <section class="text-manual__doc-section">
          <h2 id="title3" class="text-manual__section-title">Вызов функции</h2>
          <div class="text-manual__section-block">
            <p>Рассмотрим полную версию программы с функцией:</p>
            <pre><code class="python">def countFood():
    a = int(input())
    b = int(input())
    print("Всего", a+b, "шт.")

print("Сколько бананов и ананасов для обезьян?")
countFood()

print("Сколько жуков и червей для ежей?")
countFood()

print("Сколько рыб и моллюсков для выдр?")
countFood()</code></pre>
            <p>После вывода на экран каждого информационного сообщения осуществляется вызов
                функции, который выглядит просто как упоминание ее имени со скобками. Поскольку в
                функцию мы ничего не передаем скобки опять же пустые. В приведенном коде функция
                вызывается три раза.</p>
            <p>Когда функция вызывается, поток выполнения программы переходит к ее определению и
                начинает исполнять ее тело. После того, как тело функции исполнено, поток выполнения
                возвращается в основной код в то место, где функция вызывалась. Далее исполняется
                следующее за вызовом выражение.</p>
            <p>В языке Python определение функции должно предшествовать ее вызовам. Это связано с тем,
                что интерпретатор читает код строка за строкой и о том, что находится ниже по течению, ему
                еще неизвестно. Поэтому если вызов функции преддшествует ее определению, то возникает
                ошибка (выбрасывается исключение NameError):</p>
            <pre><code class="python">print("Сколько бананов и ананасов для обезьян?")
countFood()

print("Сколько жуков и червей для ежей?")
countFood()

print("Сколько рыб и моллюсков для выдр?")
countFood()

def countFood():
    a = int(input())
    b = int(input())
    print("Всего", a+b, "шт.")</code></pre>
              <p>Результат:</p>
              <pre><code class="python">Сколько бананов и ананасов для обезьян?
Traceback (most recent call last):
 File "test.py", line 2, in &lt;module&gt;
 countFood()
NameError: name 'countFood' is not defined</code></pre>
              <p>Для многих компилируемых языков это не обязательное условие. Там можно определять и
                вызывать функцию в произвольных местах программы. Однако для удобочитаемости кода
                программисты даже в этом случае предпочитают соблюдать определенные правила.</p>
          </div>
        </section>
        <section class="text-manual__doc-section">
            <h2 id="title4" class="text-manual__section-title">Функции придают программе структуру</h2>
            <div class="text-manual__section-block">
              <p>Польза функций не только в возможности многократного вызова одного и того же кода из
                разных мест программы. Не менее важно, что благодаря им программа обретает истинную
                структуру. Функции как бы разделяют ее на обособленные части, каждая из которых
                выполняет свою конкретную задачу.</p>
              <p>Пусть надо написать программу, вычисляющую площади разных фигур. Пользователь
                указывает, площадь какой фигуры он хочет вычислить. После этого вводит исходные данные.
                Например, длину и ширину в случае прямоугольника. Чтобы разделить поток выполнения на
                несколько ветвей, следует использовать оператор if-elif-else:</p>
              <pre><code class="python">figure = input("1-прямоугольник, 2-треугольник, 3-круг: ") 
if figure == '1':
a = float(input("Ширина: "))
b = float(input("Высота: "))
print("Площадь: %.2f" % (a*b))
elif figure == '2':
a = float(input("Основание: "))
h = float(input("Высота: "))
print("Площадь: %.2f" % (0.5 * a * h))
elif figure == '3':
r = float(input("Радиус: "))
print("Площадь: %.2f" % (3.14 * r**2))
else:
print("Ошибка ввода")</code></pre>
              <p>Здесь нет никаких функций, и все прекрасно. Но напишем вариант с функциями:</p>
              <pre><code class="python">def rectangle():
a = float(input("Ширина: "))
b = float(input("Высота: "))
print("Площадь: %.2f" % (a*b))

def triangle():
a = float(input("Основание: "))
h = float(input("Высота: "))
print("Площадь: %.2f" % (0.5 * a * h))

def circle():
r = float(input("Радиус: "))
print("Площадь: %.2f" % (3.14 * r**2))

figure = input("1-прямоугольник, 2-треугольник, 3-круг: ")
if figure == '1':
rectangle()
elif figure == '2':
triangle()
elif figure == '3':
circle()
else:
print("Ошибка ввода")</code></pre>
                  <p>Он кажется сложнее, а каждая из трех функций вызывается всего один раз. Однако из общей
                      логики программы как бы убраны и обособлены инструкции для нахождения площадей.
                      Программа теперь состоит из отдельных "кирпичиков Лего". В основной ветке мы можем
                      комбинировать их как угодно. Она играет роль управляющего механизма.</p>
                  <p>Если нам когда4нибудь захочется вычислять площадь треугольника по формуле Герона, а не
                      через высоту, то не придется искать код во всей программе (представьте, что она состоит из
                      тысяч строк кода как реальные программы). Мы пойдем к месту определения функций и
                      изменим тело одной из них.</p>
                  <p>Если понадобиться использовать эти функции в какой4нибудь другой программе, то мы
                      сможем импортировать их туда, сославшись на данный файл с кодом (как это делается в
                      Python, будет рассмотрено позже).</p>
                </div>
        </section>
      </div>  
  </div>
</template>
<script>
export default {
  name: "theory_9"
}
</script>
