<template>
  <div class="manual__text text-manual">
    <div class="text-manual__header">
      <h1 class="text-manual__title">Тема 13</h1>
      <div class="text-manual__subtitle">Встроенные функции</div>
    </div>
    <div class="text-manual__body">
      <section class="text-manual__doc-section">
        <h2 id="title1" class="text-manual__section-title">Разные встроенные функции</h2>
        <div class="text-manual__section-block">
          <p>Язык Python включает много уже определенных, т. е. встроенных в него, функций.
            Программист не видит их определений, они скрыты где-то в "недрах" языка. Достаточно
            знать, что эти функции принимают и что возвращают, то есть их интерфейс.</p>
          <p>Ряд встроенных функций, касающихся ввода4вывода и типов данных, мы уже использовали.
            Это print(), input(), int(), float(), str(), bool(), type(). Перечень всех встроенных в Python
            функций можно найти в официальной документации по языку: </p>
          <p><a href="https://docs.python.org/3/library/functions.html">https://docs.python.org/3/library/functions.html</a> . В переводе на русский можно посмотреть
            <a href="https://pythoner.name/documentation/library/functions">здесь</a>.</p>
          <p>В этом уроке рассмотрим следующие встроенные функции, условно разбив их на группы:</p>
          <ul>
            <li>
              <p>функции для работы с символами – ord(), chr(), len()</p>
            </li>
            <li>
              <p>математические функции – abs(), round(), divmod(), pow(), max(), min(), sum()</p>
            </li>
          </ul>
        </div>
      </section>
      <section class="text-manual__doc-section">
        <h2 id="title2" class="text-manual__section-title">Функциия для работы с символами</h2>
        <div class="text-manual__section-block">
          <p>Функция ord() позволяет получить номер символа по таблице Unicode. Соответственно,
              принимает она в качестве аргумента одиночный символ, заключенный в кавычки:</p>
          <pre><code class="python">>>> ord('z')
122
>>> ord('ф')
1092
>>> ord('@')
64</code></pre>
          <p>Функция chr() выполняет обратное действие. Она позволяет получить символ по его номеру:</p>
          <pre><code class="python">>>> chr(87)
'W'
>>> chr(1049)
'Й'
>>> chr(10045)
'*'</code></pre>
          <p>Чтобы не путать ord() и chr(), помните, что функция – это действие. Ее имя как бы отвечает
              на вопрос "Что сделать?". Order – это порядок. Значит, мы хотим получить порядковый номер
              элемента в ряду. А чтобы получить номер, должны передать символ. Character – это символ.
              Значит, мы хотим получить символ. Поэтому должны передать порядковый номер.</p>
          <p>Функция len() в качестве аргумента принимает объект, который состоит из более простых
              объектов, количество которых она подсчитывает. Числа – это простые объекты, их нельзя
              передавать в len(). Строки можно:</p>
          <pre><code class="python">>>> len('abc')
3
>>> s1 = '------'
>>> s2 = '_______'
>>> len(s1) > len(s2)
False
>>> len(s1)
6
>>> len(s2)
7</code></pre>
          <p>Кроме строк в len() можно передавать другие, еще не изученные нами, структуры данных.</p>
        </div>
      </section> 
      <section class="text-manual__doc-section">
        <h2 id="title3" class="text-manual__section-title">Математические функции</h2>
        <div class="text-manual__section-block">
          <p>Функция abs() возвращает абсолютное значение числа:</p>
          <pre><code class="python">>>> abs(-2.2)
2.2
>>> abs(9)
9</code></pre>
          <p>Если требуется округлить вещественное число до определенного знака после запятой, то
            следует воспользоваться функцией round():</p>
          <pre><code class="python">>>> a = 10/3
>>> a
3.3333333333333335
>>> round(a,2)
3.33
>>> round(a)
3</code></pre>
          <p>Если второй аргумент не задан, то округление идет до целого числа. Есть одна
            специфическая особенность этой функции. Второй аргумент может быть отрицательным
            числом. В этом случае округляться начинают единицы, десятки, сотни и т. д., то есть целая
            часть:</p>
          <pre><code class="python">>>> round(5321, -1)
5320
>>> round(5321, -3)
5000
>>> round(5321, -4)
10000</code></pre>
          <p>Функция именно округляет согласно правилу округления из математики, а не отбрасывает.</p>
          <p>Поэтому 5 тысяч неожиданно округляются до десяти. </p>
          <pre><code class="python">>>> round(3.76, 1)
3.8
>>> round(3.72, 1)
3.7
>>> round(3.72)
4
>>> round(3.22)
3</code></pre>
          <p>Если нужно просто избавиться от дробной части без округления, следует воспользоваться
              функцией int():</p>
          <pre><code class="python">>>> int(3.78)
3</code></pre>
          <p>Нередко функцию round() используют совместно с функцией print(), избегая форматирования
              вывода:</p>
          <pre><code class="python">>>> a = 3.45673
>>> print("Number: %.2f" % a)
Number: 3.46
>>> print("Number:", round(a,2))
Number: 3.46</code></pre>
          <p>В последнем случае код выглядит более ясным.</p>
          <p>Функция divmod() выполняет одновременно деление нацело и нахождение остатка от
              деления:</p>
          <pre><code class="python">>>> divmod(10, 3)
(3, 1)
>>> divmod(20, 7)
(2, 6)</code></pre>
          <p>Возвращает она кортеж, извлечение данных из которого мы пока не изучали. В других языках
              нередко встречаются две отдельные функции: div() и mod(). Первая делит нацело, вторая
              находит остаток от целочисленного деления (деления по модулю). В Python и многих других
              языках для этого используются специальные символы4операнды:</p>
          <pre><code class="python">>>> 10 // 3
3
>>> 10 % 3
1</code></pre>
          <p>Функция pow() возводит в степень. Первое число – основание, второе – показатель:</p>
          <pre><code class="python">>>> pow(3, 2)
9
>>> pow(2, 4)
16</code></pre>
          <p>То же самое можно проделать так:</p>
          <pre><code class="python">>>> 3**2
9
>>> 2**4
16</code></pre>
          <p>Однако pow() может принимать третий необязательный аргумент. Это число, на которое
            делится по модулю результат возведения в степень:</p>
          <pre><code class="python">>>> pow(2, 4, 4)
0
>>> 2**4 % 4
0</code></pre>
          <p>Преимуществом первого способа является его более быстрое выполнение.</p>
          <p>Функции max(), min() и sum() находят соответственно максимальный, минимальный элемент
            и сумму элементов аргумента:</p>
          <pre><code class="python">>>> max(10, 12, 3)
12
>>> min(10, 12, 3, 9)
3
>>> a = (10, 12, 3, 10)
>>> sum(a)
35</code></pre>
          <p>В sum() нельзя передать перечень элементов, должна быть структура данных, например,
              кортеж. В min() и max() также чаще передают один так называемый итерируемый объект:</p>
          <pre><code class="python">>>> max(a)
12</code></pre>
        </div>
      </section>
    </div>      
  </div>
</template>
<script>
export default {
  name: "theory_13"
}
</script>

