<template>
  <div class="manual__text text-manual">
    <div class="text-manual__header">
      <h1 class="text-manual__title">Тема 8</h1>
      <div class="text-manual__subtitle">Циклы в программировании. Цикл while</div>
    </div>
    <div class="text-manual__body">
      <div class="text-manual__content">
        <div class="text-manual__section-block">
            <h2 id="title1" class="text-manual__section-title">Введение в циклы</h2>
            <p>Циклы являются такой же важной частью структурного программирования, как условные
              операторы. С помощью циклов можно организовать повторение выполнения участков кода.
              Потребность в этом возникает довольно часто. Например, пользователь последовательно
              вводит числа, и каждое из них требуется добавлять к общей сумме. Или нужно вывести на
              экран квадраты ряда натуральных чисел и тому подобные задачи.</p>
        </div>
        <section class="text-manual__doc-section">
            <h2 id="title2" class="text-manual__section-title">Цикл while</h2>
            <div class="text-manual__section-block">
              <p>"While" переводится с английского как "пока". Но не в смысле "до свидания", а в смысле
                  "пока имеем это, делаем то".</p>
              <p>Можно сказать, while является универсальным циклом. Он присутствует во всех языках,
                  поддерживающих структурное программирование, в том числе в Python. Его синтаксис
                  обобщенно для всех языков можно выразить так:</p>
              <pre><code class="python">while логическое_выражение {
 выражение 1;
 …
 выражение n;
}</code></pre>
              <p>Это похоже на условный оператор if. Однако в случае циклических операторов их тела могут
                выполняться далеко не один раз. В случае if, если логическое выражение в заголовке
                возвращает истину, то тело выполняется единожды. После этого поток выполнения
                программы возвращается в основную ветку и выполняет следующие выражения,
                расположенные ниже всей конструкции условного оператора.</p>
              <p>В случае while, после того как его тело выполнено, поток возвращается к заголовку цикла и
                снова проверяет условие. Если логическое выражение возвращает истину, то тело снова
                выполняется. Потом снова возвращаемся к заголовку и так далее.</p>
              <p>Цикл завершает свою работу только тогда, когда логическое выражение в заголовке
                возвращает ложь, то есть условие выполнения цикла больше не соблюдается. После этого
                поток выполнения перемещается к выражениям, расположенным ниже всего цикла. Говорят,
                "происходит выход из цикла".</p>
              <p>Рассмотрите блоксхему цикла while.</p>
              <div class="text-manual__image-block">
                <img src="@/assets/img/theory_image/photo18.png" alt="photo18.png">
              </div>
              <p>На ней ярко-голубыми прямоугольниками обозначена основная ветка программы, ромбом –
                заголовок цикла с логическим выражением, бирюзовым прямоугольником – тело цикла.</p>
              <p>С циклом while возможны две исключительные ситуации:</p>
               <div class="text-manual__textcols textcols">
                <div class="textcols-item">
              <ul>
                <li>
                  <p>Если при первом заходе в цикл логическое выражение возвращает False, то тело цикла
                    не выполняется ни разу. Эту ситуацию можно считать нормальной, так как при
                    определенных условиях логика программы может предполагать отсутствие
                    необходимости в выполнении выражений тела цикла</p>
                </li>
                <li>
                  <p>Если логическое выражение в заголовке while никогда не возвращает False, а всегда
                    остается равным True, то цикл никогда не завершится, если только в его теле нет
                    оператора принудительного выхода из цикла (break) или вызовов функций выхода из
                    программы – quit(), exit() в случае Python. Если цикл повторяется и повторяется
                    бесконечное количество раз, то в программе происходит <b>зацикливание</b>. В это время
                    она зависает и самостоятельно завершиться не может.</p>
                </li>
              </ul>
                </div>
              </div>
              <p>Вспомним наш пример из урока про исключения. Пользователь должен ввести целое число.
                Поскольку функция input() возвращает строку, то программный код должен преобразовать
                введенное к целочисленному типу с помощью функции int(). Однако, если были введены
                символы, не являющиеся цифрами, то возникает исключение ValueError, которое
                обрабатывается веткой except. На этом программа завершается.</p>
              <p>Другими словами, если бы программа предполагала дальнейшие действия с числом
                (например, проверку на четность), а она его не получила, то единственное, что программа
                могла сделать, это закончить свою работу досрочно.</p>
              <p>Но ведь можно просить и просить пользователя корректно вести число, пока он его не введет.
                Вот как может выглядеть реализующий это код:</p>
              <pre><code class="python">n = input("Введите целое число: ")
while type(n) != int:
 try:
  n = int(n)
 except ValueError:
  print("Неправильно ввели!")
  n = input("Введите целое число: ")

if n % 2 == 0:
 print("Четное")
else:
 print("Нечетное")</code></pre>
              <p>Примечание 1. Не забываем, в языке программирования Python в конце заголовков сложных
                  инструкций ставится двоеточие.</p>
              <p>Примечание 2. В выражении type(n) != int с помощью функции type() проверяется тип
                  переменной n. Если он не равен int, т. е. значение n не является целым числом, а является в
                  данном случае строкой, то выражение возвращает истину. Если же тип n равен int, то данное
                  логическое выражение возвращает ложь.</p>
              <p>Примечание 3. Оператор % в языке Python используется для нахождения остатка от деления.
                  Так, если число четное, то оно без остатка делится на 2, т. е. остаток будет равен нулю. Если
                  число нечетное, то остаток будет равен единице.</p>
                  <p>Проследим алгоритм выполнения этого кода. Пользователь вводит данные, они имеют
                  строковый тип и присваиваются переменной n. В заголовке while проверяется тип n. При
                  первом входе в цикл тип n всегда строковый, т. е. он не равен int. Следовательно, логическое
                  выражение возвращает истину, что позволяет зайти в тело цикла.
                  Здесь в ветке try совершается попытка преобразования строки к целочисленному типу. Если
                  она была удачной, то ветка except пропускается, и поток выполнения снова возвращается к
                  заголовку while.</p>
              <p>Теперь n связана с целым числом, следовательно, ее тип int, который не может быть не равен
                  int. Он ему равен. Таким образом логическое выражение type(n) != int возвращает False,
                  и весь цикл завершает свою работу. Далее поток выполнения переходит к оператору if-else,
                  находящемуся в основной ветке программы. Здесь могло бы находиться что угодно, не
                  обязательно условный оператор.</p>
              <p>Вернемся назад. Если в теле try попытка преобразования к числу была неудачной, и было
                  выброшено исключение ValueError, то поток выполнения программы отправляется в ветку
                  except и выполняет находящиеся здесь выражения, последнее из которых просит
                  пользователя снова ввести данные. Переменная n теперь имеет новое значение.</p>
              <p>После завершения except снова проверяется логическое выражение в заголовке цикла. Оно
                  даст True, т. к. значение n по-прежнему строка.</p>
              <p>Выход из цикла возможен только тогда, когда значение n будет успешно конвертировано в
                  число.</p>
              <p>Рассмотрим следующий пример:</p>
              <pre><code class="python">total = 100
i = 0
while i &lt; 5:
 n = int(input())
 total = total - n
 i = i + 1

print("Осталось", total)</code></pre>
              <p>Сколько раз "прокрутится" цикл в этой программе, т. е. сколько итераций он сделает? Ответ:5.</p>
              <div class="text-manual__textcols">
                <ol class="textcols-item">
                  <li>
                    <p>Сначала переменная i равна 0. В заголовке цикла проверяется условие i &lt; 5, и оно
                      истинно. Тело цикла выполняется. В нем меняется значение i, путем добавления к
                      нему единицы.</p>
                  </li>
                  <li>
                    <p>Теперь переменная i равна 1. Это меньше пяти, и тело цикла выполняется второй раз.
                      В нем i меняется, ее новое значение 2.</p>
                  </li>
                  <li>
                    <p>Два меньше пяти. Тело цикла выполняется третий раз. Значение i становится равным трем.</p>
                  </li>
                  <li>
                    <p>Три меньше пяти. На этой итерации i присваивается 4.</p>
                  </li>
                  <li>
                    <p>Четыре по прежнему меньше пяти. К i добавляется единица, и теперь ее значение равно пяти. </p>
                  </li>
                </ol>
              </div>
              <p>Далее начинается шестая итерация цикла. Происходит проверка условия i &lt; 5. Но
                  поскольку теперь оно возвращает ложь, то выполнение цикла прерывается, и его тело не
                  выполняется.</p>
              <p>"Смысловая нагрузка" данного цикла – это последовательное вычитание из переменной
                  total вводимых чисел. Переменная i в данном случае играет только роль счетчика итераций
                  цикла. В других языках программирования для таких случаев предусмотрен цикл for,
                  который так и называется: "цикл со счетчиком". Его преимущество заключается в том, что в
                  теле цикла не надо изменять переменную-счетчик, ее значение меняется автоматически в
                  заголовке for.</p>
              <p>В языке Python тоже есть цикл for. Но это не цикл со счетчиком. В Питоне он предназначен
                  для перебора элементов последовательностей и других сложных объектов. Данный цикл и
                  последовательности будут изучены в последующих уроках.</p>
              <p>Для while наличие счетчика не обязательно. Представим, что надо вводить числа, пока
                  переменная total больше нуля. Тогда код будет выглядеть так:</p>
              <pre><code class="python">total = 100
while total > 0:
 n = int(input())
 total = total - n

print("Ресурс исчерпан")</code></pre>
              <p>Сколько раз здесь выполнится цикл? Неизвестно, все зависит от вводимых значений.
                  Поэтому у цикла со счетчиком известно количество итераций, а у цикла без счетчика – нет.</p>
              <p>Самое главное для цикла while – чтобы в его теле происходили изменения значений
                  переменных, которые проверяются в его заголовке, и чтобы хоть когда-нибудь наступил
                  случай, когда логическое выражение в заголовке возвращает False. Иначе произойдет
                  зацикливание.</p>
              <p>Примечание 1. Не обязательно в выражениях total = total - n и i = i + 1 повторять
                  одну и ту же переменную. В Python допустим сокращенный способ записи подобных
                  выражений: total -= n и i += 1.</p>
              <p>Примечание 2. При использовании счетчика он не обязательно должен увеличиваться на
                  единицу, а может изменяться в любую сторону на любое значение. Например, если надо
                  вывести числа кратные пяти от 100 до 0, то изменение счетчика будет таким i = i - 5, или
                  i -= 5.</p>
              <p>Примечание 3. Для счетчика не обязательно использовать переменную с идентификатором i.
                  Можно назвать переменную-счетчик как угодно. Однако так принято в программировании,
                  что счетчики обозначают именами i и j (иногда одновременно требуются два счетчика).</p>
              </div> 
        </section>
      </div>
    </div>              
  </div>
</template>
<script>
export default {
  name: "theory_8"
}
</script>
