<template>
  <div class="manual__text text-manual">
    <div class="text-manual__header">
      <h1 class="text-manual__title">Тема 1</h1>
      <div class="text-manual__subtitle">Программа. Язык программирования</div>
    </div>
    <div class="text-manual__body">
      <div class="text-manual__content">
        <section class="text-manual__doc-section">
          <h2 class="text-manual__section-title">Программа. Язык программирования</h2>
          <div class="text-manual__section-block">
            <p>Программу можно представить как набор последовательных команд (алгоритм) для объекта
              (исполнителя), который должен их выполнить для достижения определенной цели. Так
              можно "запрограммировать" человека, если составить для него инструкцию "как приготовить
              оладьи", а он начнет четко ее исполнять. При этом инструкция (программа) для человека
              будет написана на так называемом естественном языке, например, русском или английском.
            </p>
            <p>Обычно принято программировать не людей, а вычислительные машины, используя при этом
              специальные языки. Использование особых языков вызвано тем, что машины не в состоянии
              "понимать" наши, т. е. человеческие, языки. Инструкции для машин пишут на языках
              программирования, которые характеризуются синтаксической <b>однозначностью</b> (например, в
              них нельзя менять местами определенные слова) и <b>ограниченностью</b> (имеют строго
              определенный набор слов и символов).
            </p>
            <p>Программа - это набор инструкций для опрделенного исполнителя.</p>
            <p>Язык программирование - это формальный язык, предназначенный для записи программ (обычно для ЭВМ)</p>
          </div> 
        </section>
        <section class="text-manual__doc-section">
          <h2 class="text-manual__section-title">
            Основные этапы исторического развития языков программирования
          </h2>
          <div class="text-manual__section-block">
            <p>Первые программы писались на машинном Введение в программирование"языке, т.к. для ЭВМ того времени еще не
              существовало развитого программного обеспечения, а машинный язык — это единственный
              способ взаимодействия с аппаратным обеспечением компьютера, так называемым "железом".
              Каждую команду машинного языка напрямую выполняет то или иное электронное
              устройство. Данные и команды записывали в цифровом виде (например, в
              шестнадцатеричной или двоичной системах счисления). Понять программу на таком языке
              очень сложно; кроме того, даже небольшая программа получалась состоящей из множества
              строк кода. Ситуация осложнялась еще и тем, что каждая вычислительная машина понимает
              лишь свой машинный язык.
            </p>
            <p>Людям, в отличие от машин, более понятны слова, чем наборы цифр. Стремление человека
              оперировать словами, а не цифрами привело к появлению <b>ассемблеров</b>. Это языки, в которых вместо
              численного обозначения команд и областей памяти используются словесно-буквенные.</p>
            <p>При этом появляется проблема: машина не в состоянии понимать слова. Необходим какой-
              нибудь переводчик на ее родной машинный язык. Поэтому, начиная со времен ассемблеров,
              под каждый язык программирования создаются трансляторы — специальные программы,
              преобразующие программный код с языка программирования в машинный код. Ассемблеры
              на сегодняшний день продолжают использовать. В системном программировании с их
              помощью создаются низкоуровневые интерфейсы операционных систем, компоненты
              драйверов.
            </p>
            <p>После ассемблеров наступил рассвет языков так называемого <b>высокого уровня</b>. Для этих
              языков потребовалось разрабатывать более сложные трансляторы, т. к. языки высокого
              уровня куда больше удобны для человека, чем для вычислительной машины. В отличие от
              ассемблеров, которые остаются привязанными к своим типам машин, языки высоко уровня
              обладают переносимостью. Это значит, что, написав один раз программу на языке
              программирования высокого уровня, программист может выполнить ее на любом
              компьютере, если на нем установлен соответствующий ему транслятор.</p>
            <p>Следующим значимым шагом было появление <b>объектно-ориентированных языков</b>
              программирования, что, в первую очередь, было связано с усложнением разрабатываемых
              программ. С помощью таких языков программист как бы управляет виртуальными
              объектами, что в определенном смысле сближает программу с реальностью. На сегодняшний
              день в большинстве случаев реализация больших и сложных проектов осуществляется с
              помощью объектно4ориентированных возможностей языков. Хотя существуют и другие
              современные парадигмы программирования, поддерживаемые другими или теми же
              языками. 
            </p>
          </div>
          <div class="text-manual__diagram">
            <div class="diagram-list">
              <ul class="diagram-list__list">
                <li class="diagram-list__item">Машинные языки</li>
                <li class="diagram-list__item">Ассемблеры</li>
                <li class="diagram-list__item">Языки высокого уровня</li>
                <li class="diagram-list__item">Объектно-ориентированные языки</li>
              </ul>
            </div>
          </div>
        </section>
        <section class="text-manual__doc-section">
          <h2 class="text-manual__section-title">Разнообразие языков программирования</h2>
          <div class="text-manual__section-block">
            <p>В настоящее время существует множество различающихся и похожих между собой языков
              программирования. Причина такого явления становится понятна, если представить то
              количество и разнообразие задач, которые на сегодняшний день решается с помощью вычислительной
              техники. Для решения разных задач требуются разные инструменты, т. е.
              разные языки и парадигмы программирования.
            </p>
            <p>Многие программисты старались в прошлом и возможно пытаются сейчас придумать свой
              язык программирования, обладающий теми или иными преимуществами. Хотя подавляющее
              большинство в настоящее время тратят огромное количество времени на изучение уже
              существующего арсенала инструментов, поддержку и развитие имеющихся языков.
            </p>
            <p>Все существующее многообразие языков можно классифицировать по разным критериям.
              Например, по типу решаемых задач (языки системного или прикладного назначения, языки
              для web4разработки, организации баз данных, разработки мобильных приложений и др.).
              Среди наиболее популярных на сегодняшний день можно отметить Java, C++, PHP, в том
              числе Python, изучению базовых основ которого посвящен данный курс.
            </p>
          </div>
        </section>
        <section class="text-manual__doc-section">
          <h2 class="text-manual__section-title">Трансляция</h2>
          <div class="text-manual__section-block">
            <p>Ранее было сказано, что для перевода кода с языка программирования высокого уровня на
              машинный язык требуется специальная программа – транслятор.
            </p>
            <p>Заложенный в транслятор алгоритм такого перевода сложен. Нам же достаточно знать, что
              выделяют два основных способа трансляции – <b>компиляция</b> программы или ее<b>интерпретация</b>.
            </p>
            <p>При компиляции весь <b>исходный программный код</b> (тот, который пишет программист) сразу
              переводится в машинный. Создается так называемый отдельный <b>исполняемый файл</b>, который
              никак не связан с исходным кодом. Выполнение исполняемого файла обеспечивается
              операционной системой (ОС). После того как получен исполняемый файл, для его чтения
              транслятор уже не нужен.
            </p>
            <p>При интерпретации выполнение кода происходит последовательно (условно можно сказать,
              строка за строкой). Грубо говоря, операционная система взаимодействует с интерпретатором,
              а не с файлом, содержащим программный код. Интерпретатор же, прочитав очередной кусок
              исходного кода, переводит его в машинный (или не совсем машинный, но "понятный" для
              ОС) и "отдает" его ОС. ОС исполняет этот код и ждет следующей "подачки" от
              интерпретатора. Питон именно такой язык. Он интерпретируемый язык программирования.
            </p>
            <p>При интерпретации выполнение кода происходит последовательно (условно можно сказать,
              строка за строкой). Грубо говоря, операционная система взаимодействует с интерпретатором,
              а не с файлом, содержащим программный код. Интерпретатор же, прочитав очередной кусок
              исходного кода, переводит его в машинный (или не совсем машинный, но "понятный" для
              ОС) и "отдает" его ОС. ОС исполняет этот код и ждет следующей "подачки" от
              интерпретатора. Питон именно такой язык. Он интерпретируемый язык программирования.
            </p>
            <p>Выполнение откомпилированной программы происходит быстрее, т.к. она представляет
              собой готовый машинный код. Однако на современных компьютерах снижение скорости
              выполнения при интерпретации обычно не заметно. Кроме того, интерпретируемые языки
              обладают рядом преимуществ, среди которых отсутствие подготовительных действий для
              исполнения программы, что может быть важным для начинающих программировать в
              первый раз.
            </p>
          </div>
          <div class="text-manual__diagram">
            <div class="diagram-info">
              <div class="diagram-info__column diagram-info__column_1">
                <div class="diagram-info__item">
                  <h3>Траслятор</h3>
                  <p>Cпециальная программа, преобразующая программный код с того или иного языка программирования в машинный код</p>
                </div>
              </div>
              <div class="diagram-info__column diagram-info__column_2">
                <div class="diagram-info__item">
                  <h3>Компилятор</h3>
                  <p>Сразу переводит весь программный код на машинный язык. Создает исполняемый файл</p>
                </div>
              </div>
              <div class="diagram-info__column diagram-info__column_3">
                <div class="diagram-info__item">
                  <h3>Интерпетатор</h3>
                  <p>Переводит программный код построчно. Напрямую взаимодействует с ОС</p>
                </div>
              </div>
            </div>
          </div>
        </section>
      </div>
    </div>              
  </div>
</template>
