<template>
  <div class="manual__text text-manual">
    <div class="text-manual__header">
      <h1 class="text-manual__title">Тема 15</h1>
      <div class="text-manual__subtitle">Генератор псевдослучайных чисел - random</div>
    </div>
    <div class="text-manual__body">
      <section class="text-manual__doc-section">
        <h2 id="title1" class="text-manual__section-title">Определение random</h2>
        <div class="text-manual__section-block">
          <p>В компьютерных программах нередко требуется эмуляция случайности. Например, при
            разработке игр. Если в программе имеется некий генератор, т. е. производитель, случайного
            числа, то, используя полученное таким образом число, можно выбирать ту или иную ветку
            выполнения программы, или произвольный объект из коллекции. Другими словами, главное
            – сгенерировать число. Эмуляция случайности иного рода основывается на нем.</p>
          <p>Мы наверняка не знаем, есть ли в природе случайность, или она нам только кажется из4за
            ограниченности наших знаний. Мы только знаем, что в программировании настоящей
            случайности нет. Неоткуда взяться произвольному числу, нельзя запрограммировать его
            появление из ниоткуда. Можно лишь создать программу, которая в результате применения
            сложной формулы к "зерну" будет выдавать число, и нам будет казаться, что это число
            случайно.</p>
          <p>"Зерно" – это исходные данные для формулы. Им может быть, например, системное время в
            миллисекундах, которое постоянно меняется. Следовательно, "зерно" будет постоянно
            разным. Или программист может задавать его самостоятельно.</p>
          <p>Подобную программу (в реальности модуль или функцию) называют генератором
            псевдослучайных чисел. В состав стандартной библиотеки языка Python входит модуль
            random. Он содержит множество функций, связанных с эмуляцией случайности (например,
            "перемешивание" элементов последовательности), а не только функции генерации
            псевдослучайных чисел.</p>
          <p>В этом уроке будут рассмотрены функции random(), randrange() и randint() из модуля random.
            Обратите внимание, что модуль random содержит одноименную функцию random(). Так
            бывает.</p>
          <p>Чтобы обращаться к функциям, надо импортировать модуль random:</p>
          <pre><code class="python">>>> import random</code></pre>
          <p>Или импортировать отдельные функции из него:</p>
          <pre><code class="python">>>> from random import random, randrange, randint</code></pre>
        </div> 
      </section>
      <section  class="text-manual__doc-section">
        <h2 id="title2" class="text-manual__section-title">Функции для получения целых "случайных" чисел –
          randint() и randrange()</h2>
        <div class="text-manual__section-block">
          <p>Функции randint() и randrange() генерируют псевдослучайные целые числа. Первая из них
            наиболее простая и всегда принимает только два аргумента – пределы целочисленного
            диапазона, из которого выбирается любое число:</p>
          <pre><code class="python">>>> random.randint(0, 10)
6</code></pre>
          <p>или (если импортировались отдельные функции):</p>
          <pre><code class="python">>>> randint(100, 200)
110</code></pre>
          <p>В случае randint() обе границы включаются в диапазон, т. е. на языке математики отрезок
              описывается как [a; b].a; b].</p>
          <p>Числа могут быть отрицательными:</p>
          <pre><code class="python">>>> random.randint(-100, 10)
-83
>>> random.randint(-100, -10)
-38</code></pre>
          <p>Но первое число всегда должно быть меньше или, по4крайней мере, равно второму. То есть a
              &lt;= b.</p>
          <p>Функция randrange() сложнее. Она может принимать один аргумент, два или даже три. Если
              указан только один, то она возвращает случайное число от 0 до указанного аргумента.
              Причем сам аргумент в диапазон не входит. На языке математики – это [a; b].0; a).</p>
          <pre><code class="python">>>> random.randrange(10)
4</code></pre>
          <p>Или: </p>
          <pre><code class="python">>>> randrange(5)
0</code></pre>
          <p>Если в randrange() передается два аргумента, то она работает аналогично randint() за одним
              исключением. Верхняя граница не входит в диапазон, т. е. [a; b].a; b).</p>
          <pre><code class="python">>>> random.randrange(5, 10)
9
>>> random.randrange(1, 2)
1</code></pre>
          <p>Здесь результатом второго вызова всегда будет число 1.</p>
          <p>Если в randrange() передается три аргумента, то первые два – это границы диапазона, как в
            случае с двумя аргументами, а третий – так называемый шаг. Если, например, функция
            вызывается как randrange(10, 20, 3), то "случайное" число будет выбираться из чисел 10, 13,
            16, 19:</p>
          <pre><code class="python">>>> random.randrange(10, 20, 3)
13
>>> random.randrange(10, 20, 3)
19
>>> random.randrange(10, 20, 3)
10</code></pre>
        </div>
      </section>
      <section  class="text-manual__doc-section">
        <h2 id="title3" class="text-manual__section-title">Функция random() – "случайные" вещественные числа</h2>
        <div class="text-manual__section-block">
          <p>Чтобы получить случайное вещественное число, или, как говорят, число с плавающей точкой,
              следует использовать функцию random() из одноименного модуля random языка Python. Она
              не принимает никаких аргументов и возвращает число от 0 до 1, не включая 1:</p>
          <pre><code class="python">>>> random.random()
0.17855729241927576
>>> random.random()
0.3310978930421846</code></pre>
          <p>или</p>
          <pre><code class="python">>>> random()
0.025328854415995194</code></pre>
          <p>Результат содержит много знаков после запятой. Чтобы его округлить, можно
            воспользоваться встроенной в Python функцией round():</p>
          <pre><code class="python">>>> a = random.random()
>>> a
0.8366142721623201
>>> round(a, 2)
0.84
>>> round(random.random(), 3)
0.629</code></pre>
          <p>Чтобы получать случайные вещественные числа в иных пределах, отличных от [a; b].0; 1),
            прибегают к математическим приемам. Так если умножить полученное из random() число на
            любое целое, то получится вещественное в диапазоне от 0 до этого целого, не включая его:</p>
          <pre><code class="python">>>> random.random() * 10
2.510618091637596
>>> random.random() * 10
6.977540211221759</code></pre>
          <p>Если нижняя граница должна быть отличной от нуля, то число из random() надо умножать на
            разницу между верхней и нижней границами, после чего прибавить нижнюю:</p>
          <pre><code class="python">>>> random.random() * (10 - 4) + 4
9.517280589233597
>>> random.random() * (10 - 4) + 4
6.4429124181215975
>>> random.random() * (10 - 4) + 4
4.9231983600782385</code></pre>
          <p>В данном примере число умножается на 6. В результате получается число от 0 до 6. Прибавив
            4, получаем число от 4 до 10.</p>
          <p>Пример получения случайных чисел от 41 до 1:</p>
          <pre><code class="python">>>> random.random() * (1 + 1) - 1
-0.673382618351051
>>> random.random() * (1 + 1) - 1
0.34121487148075924
>>> random.random() * (1 + 1) - 1
-0.988751324713907
>>> random.random() * (1 + 1) - 1
0.44137358363477674</code></pre>
          <p>Нижняя граница равна 41. При вычитании получается +. Когда добавляется нижняя граница,
            то плюс заменяется на минус ( +(-1) = -1).</p>
          <p>Для получения псевдослучайных чисел можно пользоваться исключительно функцией
            random(). Если требуется получить целое, то всегда можно округлить до него с помощью
            round() или отбросить дробную часть с помощью int():</p>
          <pre><code class="python">>>> int(random.random() * 100)
61
>>> round(random.random() * 100 - 50)
-33</code></pre>
        </div>
      </section>         
    </div>
  </div>
</template>
