<template>
  <div class="manual__text text-manual">
    <div class="text-manual__header">
      <h1 class="text-manual__title">Тема 4</h1>
      <div class="text-manual__subtitle">Ввод и вывод данных</div>
    </div>
    <div class="text-manual__body">
      <div class="text-manual__content">
        <div class="content-inner">
          <section  class="text-manual__doc-section">
            <h2 class="text-manual__section-title">Вывод данных. Функции print()</h2>
            <div class="text-manual__section-block">
              <p>Мы уже встречались с функцией print(). Она отвечает за вывод данных, по4умолчанию на
                  экран. Если код содержится в файле, то без нее не обойтись. В интерактивном режиме в ряде
                  случаев можно обойтись без нее.</p>
              <p>Ввод данных в программу и их вывод важны в программировании. Без ввода программы
                  делали бы одно и то же, исключая случаи, когда в них самих генерируются случайные
                  значения. Вывод позволяет увидеть, использовать, передать дальше результат работы
                  программы.</p>
              <p>Обычно требуется, чтобы программа обрабатывала какой-то диапазон различных входных
                  данных, которые поступают в нее из внешних источников. В качестве последних могут
                  выступать файлы, клавиатура, сеть, выходные данные из другой программы. Вывод данных
                  также возможен в файлы и др. Однако во многих случаях это происходит на экран монитора.</p>
              <p>Можно сказать, что программа – это открытая система, которая обменивается чем4либо с
                  внешней для нее средой. Если живой организм в основном обменивается веществом и
                  энергией, то программа – данными, информацией. </p>
              <p>Что такое функция в программировании, узнаем позже. Пока будем считать, что print() – это
                  такая команда языка Python, которая выводит то, что в ее скобках на экран.</p>
              <pre><code class="python">>>> print(1032)
    1032
    >>> print(2.34)
    2.34
    >>> print("Hello")
    Hello
    </code></pre>
              <p>В скобках могут быть любые типы данных. Кроме того, количество данных может быть     различным:</p>
              <pre><code class="python">>>> print("a:", 1)
    a: 1
    >>> one = 1
    >>> two = 2
    >>> three = 3
    >>> print(one, two, three)
    1 2 3
    </code></pre>
              <p>Можно передавать в функцию print() как непосредственно литералы (в данном случае "a:" и
                  1), так и переменные, вместо которых будут выведены их значения. Аргументы функции (то,
                  что в скобках), разделяются между собой запятыми. В выводе вместо запятых значения
                  разделены пробелом.</p>
              <p>Если в скобках стоит выражение, то сначала оно выполняется, после чего print() уже выводит
                  результат данного выражения:</p>
              <pre><code class="python">>>> print("hello" + " " + "world")
    hello world
    >>> print(10 - 2.5/2)
    8.75</code></pre>
              <p>В print() предусмотрены дополнительные параметры. Например, через параметр sep можно
                  указать отличный от пробела разделитель строк:</p>
              <pre><code class="python">>>> print("Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun", sep="-")
    Mon-Tue-Wed-Thu-Fri-Sat-Sun
    >>> print(1, 2, 3, sep="//")
    1//2//3
    </code></pre>
              <p>Параметр end позволяет указывать, что делать, после вывода строки. По-умолчанию
                  происходит переход на новую строку. Однако это действие можно отменить, указав любой
                  другой символ или строку:</p>
              <pre><code class="python">>>> print(10, end="")
    10>>></code></pre>
              <p>Обычно, если end используется, то не в интерактивном режиме, а в скриптах, когда несколько
                  выводов подряд надо разделить не переходом на новую строку, а, скажем, запятыми. Сам
                  переход на новую строку обозначается комбинацией символов "\n"n". Если присвоить это
                  значение параметру end, то никаких изменений в работе функции print() вы не увидите, так
                  как это значение и так присвоено по-умолчанию:</p>
              <pre><code class="python">>>> print(10, end='\n"n')
    10
    >>></code></pre>
              <p>Однако, если надо отступить на одну дополнительную строку после вывода, то можно
                  сделать так:</p>
              <pre><code class="python">>>> print(10, end='\n"n\n"n')
    10
    >>> </code></pre>
              <p>Следующее, что стоит рассказать о функции print() – это использование форматирования
                  строк. На самом деле это никакого отношения к print() не имеет, а применяется к строкам. Но
                  обычно используется именно в сочетании с функцией print().
                  Форматирование может выполняться в так называемом старом стиле или с помощью
                  строкового метода format. Старый стиль также называют Си-стилем, так как он схож с тем,
                  как происходит вывод на экран в языке C. Рассмотрим пример:</p>
              <pre><code class="pytohn">>>> pupil = "Ben"
    >>> old = 16
    >>> grade = 9.2
    >>> print("It's %s, %d. Level: %f" % (pupil, old, grade))
    It's Ben, 16. Level: 9.200000</code></pre>
              <p>Здесь вместо трех комбинаций символов %s, %d, %f подставляются значения переменных
                  pupil, old, grade. Буквы s, d, f обозначают типы данных – строку, целое число, вещественное
                  число. Если бы требовалось подставить три строки, то во всех случаях использовалось бы
                  сочетание %s.</p>
              <p>Хотя в качестве значения переменной grade было указано число 9.2, на экран оно вывелось с
                  дополнительными нулями. Однако мы можем указать, сколько требуется знаков после
                  запятой, записав перед буквой f точку с желаемым числом знаков в дробной части:</p>
              <pre><code class="python">>>> print("It's %s, %d. Level: %.1f" % (pupil, old, grade))
    It's Ben, 16. Level: 9.2
    </code></pre>
              <p>Теперь посмотрим на метод format():</p>
              <pre><code class="python">>>> print("This is a {0}. It's {1}.".format("ball", "red"))
    This is a ball. It's red.
    >>> print("This is a {0}. It's {1}.".format("cat", "white"))
    This is a cat. It's white.
    >>> print("This is a {0}. It's {1} {2}.".format(1, "a", "number"))
    This is a 1. It's a number.
    </code></pre>
              <p>В строке в фигурных скобках указаны номера данных, которые будут сюда подставлены.
                  Далее к строке применяется метод format(). В его скобках указываются сами данные (можно
                  использовать переменные). На нулевое место подставится первый аргумент метода format(),
                  на место с номером 1 – второй и т. д.</p>
              <p>На самом деле возможности метода format() существенно шире, и для их изучения
                  понадобился бы отдельный урок. Нам пока будет достаточно этого.</p>
            </div> 
          </section>
          <section  class="text-manual__doc-section">
            <h2 class="text-manual__section-title">Ввод данных. Функция input()</h2>
            <div class="text-manual__section-block">
              <p>За ввод в программу данных с клавиатуры в Python отвечает функция <b>input()</b>. Когда
                  вызывается эта функция, программа останавливает свое выполнение и ждет, когда
                  пользователь введет текст. После этого, когда он нажмет Enter, функция input() заберет
                  введенный текст и передаст его программе, которая уже будет обрабатывать его согласно
                  своим алгоритмам.</p>
              <p>Если в интерактивном режиме ввести команду input(), то ничего интересного вы не увидите.
                  Компьютер будет ждать, когда вы что-нибудь введете и нажмете Enter или просто нажмете
                  Enter. Если вы что4то ввели, это сразу же отобразиться на экране:</p>
              <pre><code class="python">>>> input()
    Yes!
    'Yes!'</code></pre>
              <p>Функция input() передает введенные данные в программу. Их можно присвоить переменной.
                  В этом случае интерпретатор не выводит строку сразу же:</p>
              <pre><code class="python">>>> answer = input()
    No, it is not.</code></pre>
              <p>В данном случае строка сохраняется в переменной answer, и при желании мы можем
                  вывести ее значение на экран:</p>
              <pre><code class="python">>>> answer
    'No, it is not.'</code></pre>
              <p>При использовании функции print() кавычки в выводе опускаются:</p>
              <pre><code class="python">>>> print(answer)
    No, it is not.</code></pre>
              <p>Куда интересней использовать функцию input() в скриптах – файлах с кодом. Рассмотримакую программу:</p>
              <div class="text-manual__image-block">
                  <img src="@/assets/img/theory_image/photo10.png" alt="photo10.png">
              </div>
              <p>При запуске программы, компьютер ждет, когда будет введена сначала одна строка, потом
                вторая. Они будут присвоены переменным nameUser и cityUser. После этого значения этих
                переменных выводятся на экран с помощью форматированного вывода.</p>
              <p>Вышеприведенный скрипт далек от совершенства. Откуда пользователю знать, что хочет от
                него программа? Чтобы не вводить человека в замешательство, для функции input()
                предусмотрен специальный параметр4приглашение. Это приглашение выводится на экран
                при вызове input(). Усовершенствованная программа может выглядеть так:</p>
              <div class="text-manual__image-block">
                <img src="@/assets/img/theory_image/photo11.png" alt="photo11.png">
              </div>
              <p>Обратите внимание, что в программу поступает строка. Даже если ввести число, функция
                input() все равно вернет его строковое представление. Но что делать, если надо получить
                число? Ответ: использовать функции преобразования типов. </p>
              <div class="text-manual__image-block">
                <img src="@/assets/img/theory_image/photo12.png" alt="photo12.png">
              </div>
              <p>В данном случае с помощью функций int() и float() строковые значения переменных
                  qtyOranges и priceOrange преобразуются соответственно в целое число и вещественное
                  число. После этого новые численные значения присваиваются тем же переменным.</p>
              <p>Программный код можно сократить, если преобразование типов выполнить в тех же строках кода, где вызывается функция input():</p>
              <pre><code class="python">qtyOranges = int(input("Сколько апельсинов? "))
    priceOrange = float(input("Цена одного апельсина? "))
    sumOranges = qtyOranges * priceOrange
    print("Заплатите", sumOranges, "руб.")</code></pre>
              <p>Сначала выполняется функция input(). Она возвращает строку, которую функция int() или
                  float() сразу преобразует в число. Только после этого происходит присваивание переменной,
                  то есть она сразу получает численное значение.</p>
            </div>
          </section>
        </div>
      </div> 
    </div>
  </div>      
</template>
