<template>
  <div class="manual__text text-manual">
    <div class="text-manual__header">
      <h1 class="text-manual__title">Тема 3</h1>
      <div class="text-manual__subtitle">Типы данных. Переменные</div>
    </div>
    <div class="text-manual__body">
      <div class="text-manual__content">
        <div class="content-inner">
          <section  class="text-manual__doc-section">
            <h2 class="text-manual__section-title">Данные и их типы</h2>
            <div class="text-manual__section-block">
              <p>В реальной жизни мы совершаем различные действия над окружающими нас предметами,
                  или объектами. Мы меняем их свойства, наделяем новыми функциями. По аналогии с этим
                  компьютерные программы также манипулируют объектами, только виртуальными,
                  цифровыми. Пока не дойдем до уровня объектно4ориентированного программирования,
                  будем называть такие объекты данными.</p>
              <p>Очевидно, данные бывают разными. Часто компьютерной программе приходится работать с
                  числами и строками. Так на прошлом уроке мы работали с числами, выполняя над ними
                  арифметические операции. Операция сложения выполняла изменение первого числа на
                  величину второго, а умножение увеличивало одно число в количество раз, соответствующее
                  второму.</p>
              <p>Числа в свою очередь также бывают разными: целыми, вещественными, могут иметь
                  огромное значение или очень длинную дробную часть.</p> 
              <p>При знакомстве с языком программирования Python мы столкнемся с тремя типами данных:</p>
              <ul>
                <li><b>целые числа</b> (тип int) – положительные и отрицательные целые числа, а также 0
                    (например, 4, 687, 445, 0).
                </li>
                <li><b>числа с плавающей точкой</b> (тип float) – дробные, они же вещественные, числа
                    (например, 1.45, 43.789654, 0.00453). Примечание: для разделения целой и дробной
                    частей здесь используется точка, а не запятая.
                </li>
                <li><b>строки</b> (тип str) — набор символов, заключенных в кавычки (например, "ball", "What
                    is your name?", 'dkfjUUv', '6589'). Примечание: кавычки в Python могут быть
                    одинарными или двойными; одиночный символ в кавычках также является строкой,
                    отдельного символьного типа в Питоне нет.
                </li>
              </ul>
            </div> 
          </section>
          <section class="text-manual__doc-section">
            <h2 class="text-manual__section-title">Операции в программировании</h2>
            <div class="text-manual__section-block">
              <p><b>Операция</b> – это выполнение каких-либо действий над данными, которые в данном случае
                  именуют <b>операндами</b>. Само действие выполняет <b>оператор</b> – специальный инструмент. Если
                  бы вы выполняли операцию постройки стола, то вашими операндами были бы доска и гвоздь, а оператором – молоток.</p>
              <p>Так в математике и программировании символ плюса является оператором операции
                  сложения по отношению к числам. В случае строк этот же оператор выполняет операцию
                  <em>конкатенации</em>, т. е. соединения</p>
              <pre><code class="python">>>> 10.25 + 98.36
108.61
>>> 'Hello' + 'World'
'HelloWorld'</code></pre>
              <p>Здесь следует для себя отметить, что то, что делает оператор в операции, зависит не только от
                  него, но и от типов данных, которыми он оперирует. Молоток в случае нападения на вас
                  крокодила перестанет играть роль строительного инструмента. Однако в большинстве
                  случаев операторы не универсальны. Например, знак плюса неприменим, если операндами
                  являются, с одной стороны, число, а с другой – строка.</p>
              <pre><code class="python">>>> 1 + 'a'
Traceback (most recent call last):
File "&lt;stdin&gt;", line 1, in &lt;module&gt;
TypeError: unsupported operand type(s) for +: 'int' and 'str'</code></pre>
              <p>Здесь в строке TypeError: unsupported operand type(s) for +: 'int' and 'str'
                    интерпретатор сообщает, что произошла ошибка типа – неподдерживаемый операнд для
                    типов int и str</p>
            </div>
          </section>
          <section  class="text-manual__doc-section">
            <h2 class="text-manual__section-title">Изменение типов данных</h2>
            <div class="text-manual__section-block">
              <p>Приведенную выше операцию все4таки можно выполнить, если превратить число 1 в строку
                  "1". Для изменения одних типов данных в другие в языке Python предусмотрен ряд
                  встроенных в него функций (что такое функция в принципе, вы узнаете в других уроках).
                  Поскольку мы пока работаем только с тремя типами (int, float и str), то рассмотрим только
                  соответствующие им функции: int(), float(), str().</p>
              <pre><code class="python">>>> str(1) + 'a'
'1a'
>>> float('3.2') + int('2')
5.2
>>> str(4) + str(1.2)
'41.2'</code></pre>
              <p>Эти функции преобразуют то, что помещается в их скобки соответственно в целое число,
                  вещественное число или строку. Однако надо понимать, что преобразовать можно не все:</p>
              <pre><code class="python">>>> int('hi')
Traceback (most recent call last):
File "&lt;stdin&gt;", line 1, in &lt;module&gt;
ValueError: invalid literal for int() with base 10: 'hi'</code></pre>
              <p>Здесь возникла ошибка значения (ValueError), так как передан литерал (в данном случае
                  строка с буквенными символами), который нельзя преобразовать к числу с основанием 10.
                  Однако функция int() не такая простая:</p>
              <pre><code class="python">>>> int('101', 2)
5
>>> int('F', 16)
15</code></pre>
                <p>Если вы знаете о различных системах счисления, то поймете, что здесь произошло.</p>
                <p>Обратите внимание еще на одно. Данные могут называться значениями, а также
                    литералами. Эти три понятия ("данные", "значение", "литерал") не обозначают одно и то же,
                    но близки и нередко употребляются как синонимы. Чтобы понять различие между ними,
                    места их употребления, надо изучить программирование глубже.</p>
            </div>
          </section>
          <section  class="text-manual__doc-section">
            <h2 class="text-manual__section-title">Переменные</h2>
            <div class="text-manual__section-block">
              <p>Данные хранятся в ячейках памяти компьютера. Когда мы вводим число, оно помещается в
                какую4то ячейку памяти. Но как потом узнать, куда именно? Как впоследствии обращаться к
                этим данными? Нужно как4то запомнить, пометить соответствующую ячейку.</p>
              <p>Раньше, при написании программ на машинном языке, обращение к ячейкам памяти
                осуществляли с помощью указания их регистров, т. е. конкретно сообщали, куда положить
                данные и откуда их взять. Однако с появлением ассемблеров при обращении к данным стали
                использовать словесные <b>переменные</b>, что куда удобней для человека.</p>
              <p>Механизм связи между переменными и данными может различаться в зависимости от языка
                программирования и типов данных. Пока достаточно запомнить, что в программе данные
                связываются с каким4либо именем и в дальнейшем обращение к ним возможно по этому
                имени переменной.</p>
              <p>Слово "переменная" обозначает, что сущность может меняться, она непостоянна.
                Действительно, вы увидите это в дальнейшем, одна и та же переменная может быть связана
                сначала с одними данными, а потом – с другими. То есть ее значение может меняться, она переменчива.</p>
              <p>В программе на языке Python, как и на большинстве других языков, связь между данными и
                переменными устанавливается с помощью знака =. Такая операция называется
                <b>присваивание</b> (также говорят "присвоение"). Например, выражение sq = 4 означает, что на
                объект, представляющий собой число 4, находящееся в определенной области памяти, теперь
                ссылается переменная sq, и обращаться к этому объекту следует по имени sq.</p>
              <p>Имена переменных могут быть любыми. Однако есть несколько общих правил их написания:</p>
              <div class="text-manual__textcols">
                <div class="textcols-item">
                  <ol>
                    <li>Желательно давать переменным осмысленные имена, говорящие о назначении
                        данных, на которые они ссылаются.
                    </li>
                    <li>Имя переменной не должно совпадать с командами языка (зарезервированными
                        ключевыми словами).
                    </li>
                    <li>Имя переменной должно начинаться с буквы или символа подчеркивания (_), но не с
                        цифры.
                    </li>
                    <li>Имя переменной не должно содержать пробелы.</li>
                    <li>Чтобы узнать значение, на которое ссылается переменная, находясь в режиме
                        интерпретатора, достаточно ее вызвать, т. е. написать имя и нажать Enter.
                    </li>
                  </ol>
                </div>
              </div>
              <pre><code class="python">>>> sq = 4
>>> sq 
4</code></pre>
              <p>Вот более сложный пример работы с переменными в интерактивном режиме:</p>
              <pre><code class="python">>>> apples = 100
>>> eat_day = 5
>>> day = 7
>>> apples = apples - eat_day * day
>>> apples
65  </code></pre>
              <p>Здесь фигурируют три переменные: apples, eat_day и day. Каждой из них присваивается свое
                значение. Выражение apples = apples - eat_day * day сложное. Сначала выполняется
                подвыражение, стоящее справа от знака равенства. После этого его результат присваивается
                переменной apples, в результате чего ее старое значение (100) теряется. В подвыражении
                apples - eat_day * day вместо имен переменных на самом деле используются их
                значения, т. е. числа 100, 5 и 7.</p>
            </div>
          </section>
        </div><!--//content-inner-->
      </div><!--//doc-content-->
    </div>
  </div>     
</template>
