<template>
  <div class="manual__text text-manual">
    <div class="text-manual__header">
      <h1 class="text-manual__title">Тема 2</h1>
      <div class="text-manual__subtitle">Знакомство с Python</div>
    </div>
    <div class="text-manual__body">
      <div class="text-manual__content">
        <section class="text-manual__doc-section">
          <h2 id="title1" class="text-manual__section-title">Краткая историческая справка</h2>
          <div class="text-manual__section-block">
            <p>Язык программирования Python был создан к 1991 году голландцем Гвидо ван Россумом.</p>
            <p>Свое имя – Пайтон (или Питон) – получил от названия телесериала, а не пресмыкающегося.</p>
            <p>После того, как Россум разработал язык, он выложил его в Интернет, где сообщество
            программистов присоединилось к его улучшению.</p>
            <p>Python активно развивается в настоящее время. Часто выходят новые версии. Существуют
              две поддерживаемые ветки: Python 2.x и Python 3.x. Здесь английской буквой "x"
              обозначается конкретный релиз. Между вторым и третьим Питоном есть небольшая разница.
              В данном курсе за основу берется Python 3.x.</p>
            <p>Официальный сайт поддержки языка – <a href="http://python.org">http://python.org.</a></p>
          </div> 
        </section>                                    
        <section class="text-manual__doc-section">
          <h2 id="title2"  class="text-manual__section-title">Основные особенности языка</h2>
          <div class="text-manual__section-block">
            <p>Python – интерпретируемый язык программирования. Это значит, что исходный код частями
                преобразуется в машинный в процессе его чтения специальной программой –интерпретатором. </p>
            <p>Python характеризуется ясным синтаксисом. Читать код на нем легче, чем на других языках
                программирования, т. к. в Питоне мало используются такие вспомогательные синтаксические
                элементы как скобки, точки с запятыми. С другой стороны, правила Введение в программирование"
                языка Введение в программирование"заставляют Введение в программирование"
                программистов Введение в программирование"делать Введение в программирование"отступы Введение 
                в программирование"для обозначения вложенных конструкций. Понятно, что хорошо оформленный текст с малым количеством отвлекающих элементов читать и
                понимать легче.</p>   
            <p>Python – это полноценный во многом универсальный язык программирования, используемый
                в различных сферах. Основная, но не единственная, поддерживаемая им парадигма, –
                объектно4ориентированное программирование. Однако в данном курсе мы только упомянем
                об объектах, а будем изучать структурное программирование, так как оно является базой. Без
                знания основных типов данных, ветвлений, циклов, функций нет смысла изучать более
                сложные парадигмы, т. к. в них все это используется.</p>   
            <p>Интерпретаторы Python распространяется свободно на основании лицензии подобной GNU
                General Public License.</p>  
          </div>
        </section>
        <section class="text-manual__doc-section">
          <h2 id="title3" class="text-manual__section-title">Дзен Питона</h2>
          <div class="text-manual__section-block">
            <p>Если интерпретатору Питона дать команду <b>import this</b> ("импортируй это" здесь видимо
              следует понимать как "импортируй самого себя"), то выведется так называемый "Дзен
              Питона", иллюстрирующий идеологию и особенности данного языка. Понимание смысла
              этих постулатов в приложении к программированию придет тогда, когда вы освоите язык в
              полной мере и приобретете опыт практического программирования.</p>
            <div class="text-manual__textcols textcols">
              <div class="textcols-item">
                <ol>
                  <li>Beautiful is better than ugly</li>
                  <li>Explicit is better than implicit</li>
                  <li>Simple is better than complex</li>
                  <li>Complex is better than complicated</li>
                  <li>Flat is better than nested</li>
                  <li>Sparse is better than dense</li>
                  <li>Readability counts</li>
                  <li>Special cases aren't special enough to
                      break the rules</li>
                  <li>Although practicality beats purity</li>
                  <li>Errors should never pass silently</li>
                  <li>Unless explicitly silenced.</li>
                  <li>In the face of ambiguity, refuse the
                      temptation to guess</li>
                  <li>There should be one – and preferably only
                      one – obvious way to do it</li>
                  <li>Although that way may not be obvious at
                      first unless you're Dutch</li>
                  <li>Now is better than never</li>
                  <li>Although never is often better than *right*
                      now.</li>
                  <li>If the implementation is hard to explain,
                      it's a bad idea</li>
                  <li>If the implementation is easy to explain, it
                      may be a good idea</li>
                  <li>Namespaces are one honking great idea —
                      let's do more of those!</li>
                </ol>
              </div>
              <div class="textcols-item">
                <ol>
                  <li>Красивое лучше уродливого</li>
                  <li>Явное лучше неявного</li>
                  <li>Простое лучше сложного</li>
                  <li>Сложное лучше усложнённого</li>
                  <li>Плоское лучше вложенного</li>
                  <li>Разрежённое лучше плотного</li>
                  <li>Удобочитаемость важна</li>
                  <li>Частные случаи не настолько существенны,
                      чтобы нарушать правила</li>
                  <li>Однако практичность важнее чистоты</li>
                  <li>Ошибки никогда не должны замалчиваться</li>
                  <li>За исключением замалчивания, которое
                      задано явно</li>
                  <li>В случае неоднозначности
                      сопротивляйтесь искушению угадать</li>
                  <li>Должен существовать один – и, желательно,
                      только один – очевидный способ сделать это</li>
                  <li>Хотя он может быть с первого взгляда не
                      очевиден, если ты не голландец</li>
                  <li>Сейчас лучше, чем никогда</li>
                  <li>Однако, никогда чаще лучше, чем прямо
                      сейчас</li>
                  <li>Если реализацию сложно объяснить – это
                      плохая идея</li>
                  <li>Если реализацию легко объяснить – это
                      может быть хорошая идея</li>
                  <li>Пространства имён – прекрасная идея,
                      давайте делать их больше!</li>
                </ol>
              </div>
            </div>
          </div>            
        </section>
        <section id="title4"  class="text-manual__doc-section">
          <h2 class="text-manual__section-title">Как писать программы на Python</h2>
          <div class="text-manual__section-block">
            <h3>Интерактивный режим</h3>
            <p>Грубо говоря, интерпретатор выполняет команды построчно. Пишешь строку, нажимаешь
                Enter, интерпретатор выполняет ее, наблюдаешь результат.</p>
            <p>Это удобно, когда изучаешь особенности языка или тестирует какую4нибудь небольшую
                часть кода. Ведь если работать на компилируемом языке, то пришлось бы сначала создать
                файл с кодом на исходном языке программирования, затем передать его компилятору,
                получить от него исполняемый файл и только потом выполнить программу и оценить
                результат. К счастью, даже в случае с компилируемыми языками все эти действия выполняет
                среда разработки, что упрощает жизнь программиста.</p>
            <p>В операционных системах на базе ядра Linux можно программировать на Python в
                интерактивном режиме с помощью приложения «Терминал», в котором работает командная
                оболочка Bash. Здесь, чтобы запустить интерпретатор, надо выполнить команду python.</p>
            <div class="text-manual__image-block">
                <img src="@/assets/img/theory_image/photo4.png" alt="photo4.png">
            </div>
            <p>Скорее всего запустится интерпретатор второй ветки Питона, что можно увидеть в первой
                информационной строке. В данном случае запустилась версия 2.7.12. Первое число «2»
                указывает на то, что это интерпретатор для языка программирования Python 2. Последняя
                строка с тремя угловыми скобками (>>>) – это приглашение для ввода команд. Поскольку в
                данном курсе будет использоваться язык Python 3, выйдем из интерпретатора с помощью
                команды exit() (plustilino)exit – выход). После чего выполним в терминале команду python3.</p>
            <div class="text-manual__image-block">
                <img src="@/assets/img/theory_image/photo5.png" alt="photo4.png">
            </div>
            <p>Есть вероятность, что пакет python3 может быть не установлен. Вам придется
                самостоятельно установить его.
                Для операционных систем семейства Windows надо скачать интерпретатор с официального
                сайта языка (<a href="https://www.python.org/downloads/windows/">https://www.python.org/downloads/windows/)</a>. После установки он будет
                запускаться по ярлыку. Использовать командную оболочку здесь не требуется.
                Возможности Python позволяют использовать его как калькулятор. Поскольку команды языка
                мы не изучали, это хороший способ протестировать интерактивный ввод команд.</p>
            <div class="text-manual__image-block">
                <img src="@/assets/img/theory_image/photo6.png" alt="photo4.png">
            </div>
            <p>Бывает, что в процессе ввода была допущена ошибка или требуется повторить ранее
                используемую команду. Чтобы заново не вводить строку, в консоли можно прокручивать
                историю команд, используя для этого стрелки вверх и вних на клавиатуре. В среде IDLE (plustilino)в
                Windows) для этого используются сочетания клавиш (скорее всего Alt+N и Alt+P).</p>
            <h3>Создание скриптов</h3>
            <p>Несмотря на удобства интерактивного режима, чаще всего необходимо сохранить исходный
                программный код для последующего выполнения и использования. В таком случае
                подготавливаются файлы, которые передаются затем интерпретатору на исполнение. Файлы с
                кодом на Python обычно имеют расширение .py.</p>
            <p>уществует целый ряд сред разработки для Python, например, PyCharm. Однако на первое
                время подойдет текстовый редактор с подсветкой синтаксиса, например, Geany. </p>
            <div class="text-manual__image-block">
                <img src="@/assets/img/theory_image/photo7.png" alt="photo4.png">
            </div>
            <p>Здесь создается и сохраняется файл с кодом. Далее его можно запустить на выполнение через
                терминал. При этом сначала указывается интерпретатор (в данном случае python3), потом
                имя файла (если файл находится в другом каталоге, то указывается с адресом, или надо
                перейти в этот каталог с помощью команды cd оболочки Bash).</p>
            <div class="text-manual__image-block">
                <img src="@/assets/img/theory_image/photo8.png" alt="photo4.png">
            </div>
            <p>Однако в Geany можно дополнительно установить встроенный терминал (sudo apt4get install
                libvte9), что упростит работу.</p>
            <div class="text-manual__image-block">
                <img src="@/assets/img/theory_image/photo9.png" alt="photo4.png">
            </div>
            <p>Наконец, в редакторе можно просто нажать F5, что отправит файл на исполнение (терминал
                откроется сам, после выполнения программы и нажатия Enter закроется).</p>
            <p>В Windows подготовить файлы можно в той же среде IDLE. Для этого в меню следует
                выбрать команду <b>File - New Window</b> (Crtl + N), откроется чистое (без приглашения >>>)
                новое окно. Желательно сразу сохранить файл с расширением <b>.py</b>, чтобы появилась подсветка
                синтаксиса. После того как код будет подготовлен, снова сохраните файл. Запуск скрипта
                выполняется командой <b>Run - Run Module</b> (F5). После этого в окне интерактивного режима
                появится результат выполнения кода.</p>
          </div> 
        </section>
      </div>
    </div>          
  </div>
</template>
