<template>
  <div class="manual__text text-manual">
    <div class="text-manual__header">
      <h1 class="text-manual__title">Тема 6</h1>
      <div class="text-manual__subtitle">Ветвление. Условный оператор</div>
    </div>
    <div class="text-manual__body">
      <div class="text-manual__content">
        <section  class="text-manual__doc-section">
            <h2 id="title1" class="text-manual__section-title">Определение</h2>
            <div class="text-manual__section-block">
              <p>Ход выполнения программы может быть <em>линейным</em>, то есть таким, когда выражения
                выполняются друг за другом, начиная с первого и заканчивая последним. Ни одна строка
                кода программы не пропускается.</p>
              <p>Однако чаще в программах бывает не так. При выполнении кода, в зависимости от тех или
                иных условий, некоторые его участки могут быть опущены, в то время как другие –
                выполнены. Иными словами, в программе может присутствовать <em>ветвление</em>, которое
                реализуется <b>условным оператором – особой конструкцией языка программирования.</b></p>
              <p>Проведем аналогию с реальностью. Человек живет по расписанию. Можно сказать,
                расписание – это алгоритм для человека, его программный код, подлежащий выполнению. В
                расписании на 18.00 стоит поход в бассейн. Однако экземпляр биоробота класса Homo
                sapiens через свои рецепторы4сенсоры получает информацию, что воду из бассейна слили.
                Разумно было бы отменить занятие по плаванию, т. е. изменить ход выполнения программы4
                расписания. Одним из условий посещения бассейна должно быть его функционирование,
                иначе должны выполняться другие действия.</p>
              <p>Подобная нелинейность действий может быть реализована в компьютерной программе.
                Например, часть кода будет выполняться лишь при определенном значении конкретной
                переменной. В языках программирования используется приблизительно такая конструкция
                условного оператора:</p>
              <pre><code class="python">if логическое_выражение {
выражение 1;
выражение 2;
…
}</code></pre>
              <p>Перевести на человеческий язык можно так: <b>если логическое выражение возвращает 
                  истину, то выполняются выражения внутри фигурных скобок</b>; если логическое
                  выражение возвращает ложь, то код внутри фигурных скобок не выполняется. С английского
                  "if" переводится как "если".</p>
              <p>Конструкция if логическое_выражение называется <b>заголовком условного оператора</b>.
                  Выражения внутри фигурных скобок – <b>телом условного оператора</b>. Тело может содержать
                  как множество выражений, так и всего одно или даже быть пустым.</p>
              <p>Пример использования условного оператора в языке программирования Python:</p>
              <pre><code class="python">if n &lt; 100:
b = n + a</code></pre>
              <p>В Питоне вместо фигурных скобок используется двоеточие. Обособление вложенного кода, т.
                  е. тела оператора, достигается за счет отступов. В программировании принято делать отступ
                  равным четырем пробелам. Однако также можно использовать клавишу табуляции (Tab) на
                  клавиатуре. Большинство сред программирования автоматически делают отступ, как только
                  вы поставите двоеточие и перейдете на новую строку. Однако при работе в интерактивном
                  режиме надо делать отступы вручную.</p>
              <p>Нахождение в теле условного оператора здесь обозначается тремя точками. При создании
                  файла со скриптом таких точек быть не должно, как и приглашения. </p>
              <p>Python считается языком с ясным синтаксисом и легко читаемым кодом. Это достигается
                  сведением к минимуму таких вспомогательных элементов как скобок и точек с запятой. Для
                  разделения выражений используется переход на новую строку, а для обозначения вложенных
                  выражений – отступы от начала строки. В других языках данный стиль программирования
                  также используется, но лишь для удобочитаемости кода человеком. В Питоне же он возведен
                  в ранг синтаксического правила.</p>
              <p>В примере выше логическим выражением является n &lt; 100. Если оно возвращает истину, то
                  выполнится строчка кода b = n + a. Если логическое выражение ложно, то выражение b =
                  n + a не выполнится.</p>
              <p>Данный пример вырван из контекста и сам по4себе не является рабочим. Полная версия
                  программы могла бы выглядеть так:</p>
              <pre><code class="python">b = 0
a = 50
n = 98
if n &lt; 100:
b = n + a
print(b)
</code></pre>
              <p>Последняя строчка кода print(b) уже не относится к условному оператору, что обозначено
                  отсутствием перед ней отступа. Она не является вложенной в условный оператор, значит, не
                  принадлежит ему.</p>
              <p>Поскольку переменная n равна 98, а это меньше 100, то b станет равной 1484ми. Это значение
                  будет выведено на экран. Если переменная n изначально была бы связана, например, со
                  значением 101, то на экран был бы выведен 0. При n, равной 101, логическое выражение в
                  заголовке условного оператора вернуло бы ложь. Значит, тело не было бы выполнено, и
                  переменная b не изменилась бы.</p>
              <p>Структуру программы можно изобразить следующим образом:</p>
              <div class="text-manual__show-list show-list">
                  <ul class="show-list__list">
                    <li class="show-list__item">Основной код</li>
                    <li class="show-list__item">Основной код</li>
                  </ul>
                  <ul class="show-list__list show-list__list_right">
                    <li class="show-list__item">Вложенный код</li>
                    <li class="show-list__item">Вложенный код</li>
                  </ul>
                  <ul class="show-list__list">
                    <li class="show-list__item">Основной код</li>
                    <li class="show-list__item">Основной код</li>
                  </ul>
              </div>
              <p>Основная ветка программы выполняется всегда, а вложенный код лишь тогда, когда в темно4
                зеленой строчке, обозначающей заголовок условного оператора, случается истина.</p>
              <p>Для небольших программ иногда чертят так называемые блок4схемы, отражающие алгоритм
                выполнения. В языке блок4схем определенные конструкции обозначаются своими фигурами.</p>
              <p>Так блок действий обозначается прямоугольником, а логическое выражение – ромбом. Для
                кода выше блок4схема может выглядеть так:</p>
              <div class="text-manual__image-block">
                <img src="@/assets/img/theory_image/photo15.png" alt="photo15.png">
              </div>                
              <p>Условный оператор может включать не одну ветку, а две, реализуя тем самым полноценное ветвление.</p>
              <div class="text-manual__image-block">
                <img src="@/assets/img/theory_image/photo16.png" alt="photo16.png">
              </div>
              <p>В случае возврата логическим выражением False поток выполнения программы не
                возвращается сразу в основную ветку. На случай False существует другой вложенный код,
                отличный от случая True. Другими словами, встретившись с расширенной версией условного
                оператора, поток выполнения программы не вернется в основную ветку, не выполнив хоть
                какой4нибудь вложенный код.</p>
              <p>В языках программирования разделение на две ветви достигается с помощью добавления
                блока else, получается так называемое if–else (если-иначе). Синтаксис выглядит примерно так:</p>
              <pre><code class="python">if логическое_выражение {
 выражение 1;
 выражение 2;
 …
}
else {
 выражение 3;
 …
}</code></pre>
              <p>Если условие при инструкции if оказывается ложным, то выполняется блок кода при
                инструкции else. <b>Ситуация, при которой бы выполнились обе ветви, невозможна</b>. Либо
                код, принадлежащий if, либо код, принадлежащий еlse. Никак иначе. <b>В заголовке else 
                никогда не бывает логического выражения.</b></p>
              <p>Пример кода с веткой else на языке программирования Python:</p>
              <pre><code class="python">tovar1 = 50
tovar2 = 32
if tovar1+ tovar2 > 99 :
 print("99 рублей недостаточно")
else:
 print("Чек оплачен")</code></pre>
              <p>Следует иметь в виду, что логическое выражение при if может выглядеть «нестандартно», т.
                е. не так просто, как a > b и тому подобное. Там может стоять просто одна переменная,
                число, слово True или False, а также сложное логическое выражение, когда два простых
                соединяются через логически И или ИЛИ. </p>
              <pre><code class="python">a = ?
if a:
 a = 1</code></pre>
              <p>Если вместо знака вопроса будет стоять 0, то с логической точки зрения это False, значит
                  выражение в if не будет выполнено. Если a будет связано с любым другим числом, то оно
                  будет расцениваться как True, и тело условного оператора выполнится. Другой пример:</p>
              <pre><code class="python">a = 5 > 0
if a:
 print(a)</code></pre>
              <p>Здесь a уже связана с булевым значением. В данном случае это True. Отметим, что в
                выражении a = 5 > 0 присваивание выполняется после оператора сравнения, так что
                подвыражение 5 > 0 выполнится первым, после чего его результат будет присвоен
                переменной a. На будущее, если вы сомневаетесь в последовательности выполнения
                операторов, используйте скобки, например так: a = (5 > 0).</p>
              <p>Третий пример:</p>
              <pre><code class="python">if a > 0 and a &lt; b:
print(b - a)</code></pre>
              <p>Тут, чтобы вложенный код выполнился, a должно быть больше нуля и одновременно меньше
                b. Также в Питоне, в отличие от других языков программирования, позволительна такая
                сокращенная запись сложного логического выражения:</p>
              <pre><code class="python">if 0 &lt; a &lt; b:
 print(b - a)
</code></pre>
              </div> 
        </section>
      </div>
    </div>              
  </div>         
</template>
