<template>
  <div class="manual__text text-manual">
    <div class="text-manual__header">
      <h1 class="text-manual__title">Тема 14</h1>
      <div class="text-manual__subtitle">Модули</div>
    </div>
    <div class="text-manual__body">
      <section  class="text-manual__doc-section">
        <h2 id="title1" class="text-manual__section-title">Ключевое слово import</h2>
        <div class="text-manual__section-block">
          <p>Встроенные в язык программирования функции доступны сразу. Чтобы их вызвать, не надо
            выполнять никаких дополнительных действий. Однако за время существования любого
            популярного языка на нем было написано столько функций и классов, которые оказались
            востребованными множеством программистов и в разных областях, что включить весь этот
            объем кода в сам язык если возможно, то нецелесообразно.</p>
          <p>Чтобы разрешить проблему доступа к дополнительным возможностям языка, в
            программировании стало общепринятой практикой использовать так называемые модули,
            пакеты и библиотеки. Каждый модуль содержит коллекцию функций и классов,
            предназначенных для решения задач из определенной области. Так в модуле math языка
            Python содержатся математические функции, модуль random позволяет генерировать
            псевдослучайные числа, в модуле datetime содержатся классы для работы с датами и
            временем, модуль sys предоставляет доступ к системным переменным и т. д.</p>
          <p>Количество модулей для языка Python огромно, что связано с популярностью языка. Часть
            модулей собрана в так называемую стандартную библиотеку. Стандартная она потому, что
            поставляется вместе с установочным пакетом. Однако существуют сторонние библиотеки.
            Они скачиваются и устанавливаются отдельно.</p>
          <p>Для доступа к функционалу модуля, его надо импортировать в программу. После импорта
            интерпретатор "знает" о существовании дополнительных классов и функций и позволяет ими
            пользоваться. </p>
          <p>В Питоне импорт осуществляется командой import. При этом существует несколько способов
            импорта. Рассмотрим работу с модулем на примере math. Итак, </p>
          <pre><code class="python">>>> import math</code></pre>
          <p>Ничего не произошло. Однако в глобальной области видимости появилось имя math. Если до
              импорта вы упомянули бы имя math, то возникла бы ошибка NameError. Теперь же</p>
          <pre><code class="python">>>> math
&lt;module 'math' (built-in)&gt;</code></pre>
          <p>В программе завелся объект math, относящийся к классу module.
            Чтобы увидеть перечень функций, входящих в этот модуль, воспользуемся встроенной в
            Python функцией dir(), передав ей в качестве аргумента имя модуля:</p>
          <pre><code class="python">>>> dir(math)
['__doc__', '__loader__', '__name__', '__package__', '__spec__', 'acos',
'acosh', 'asin', 'asinh', 'atan', 'atan2', 'atanh', 'ceil', 'copysign', 'cos',
'cosh', 'degrees', 'e', 'erf', 'erfc', 'exp', 'expm1', 'fabs', 'factorial',
'floor', 'fmod', 'frexp', 'fsum', 'gamma', 'gcd', 'hypot', 'inf', 'isclose',
'isfinite', 'isinf', 'isnan', 'ldexp', 'lgamma', 'log', 'log10', 'log1p',
'log2', 'modf', 'nan', 'pi', 'pow', 'radians', 'sin', 'sinh', 'sqrt', 'tan',
'tanh', 'trunc']</code></pre>
          <p>Проигнорируем имена с двойными подчеркиваниями. Все остальное – имена функций и
            констант (переменных, которые не меняют своих значений), включенных в модуль math.
            Чтобы вызвать функцию из модуля, надо впереди написать имя модуля, поставить точку,
            далее указать имя функции, после чего в скобках передать аргументы, если они требуются.</p>
          <p>Например, чтобы вызвать функцию pow из math, надо написать так:</p>
          <pre><code class="python">>>> math.pow(2, 2)
4.0</code></pre>
          <p>Обратите внимание, эта другая функция pow(), не та, что встроена в сам язык. "Обычная"
            функция pow() возвращает целое, если аргументы целые числа:</p>
          <p>>>> pow(2, 2)4</p>
          <p>Для обращения к константе скобки не нужны:</p>
          <pre><code class="python">>>> math.pi
3.141592653589793</code></pre>
          <p>Если мы не знаем, что делает та или иная функция, то можем получить справочную
            информацию о ней с помощью встроенной в язык Python функции help():</p>
          <pre><code class="python">>>> help(math.gcd)
Help on built-in function gcd in module math:
    
gcd(...)        
    gcd(x, y) -> int
    greatest common divisor of x and y</code></pre>
          <p>Для выхода из интерактивной справки надо нажать клавишу q. В данном случае сообщается,
            что функция возвращает целое число, и это наибольший общий делитель для чисел x и y.
            Описание модулей и их содержания также можно посмотреть в официальной документации
            на сайте <a href="python.org">python.org</a>.</p>
          <p>Второй способ импорта – это когда импортируется не сам модуль, а только необходимые
            функции из него.</p>
          <pre><code class="python">>>> from math import gcd, sqrt, hypot</code></pre>
          <p>Перевести можно как "из модуля math импортировать функции gcd, sqrt и hypot".</p>
          <p>В таком случае при их вызове не надо перед именем функции указывать имя модуля:</p>
          <pre><code class="python">>>> gcd(100, 150)
50
>>> sqrt(16)
4.0
>>> hypot(3, 4)
5.0</code></pre>
          <p>Чтобы импортировать сразу все функции из модуля:</p>
          <pre><code class="python">>>> from math import *</code></pre>
          <p>Импорт через from не лишен недостатка. В программе уже может быть идентификатор с
            таким же именем, как имя одной из импортируемых функций или констант. Ошибки не будет,
            но одно из них окажется "затерто":</p>
          <pre><code class="python">>>> pi = 3.14
>>> from math import pi
>>> pi
3.141592653589793</code></pre>
          <p>Здесь исчезает значение 3.14, присвоенное переменной pi. Это имя теперь указывает на число
            из модуля math. Если импорт сделать раньше, чем присвоение значения pi, то будет все
            наоборот:</p>
          <pre><code class="python">>>> from math import pi
>>> pi = 3.14
>>> pi
3.14</code></pre>
          <p>В этой связи более опасен именно импорт всех функций. Так как в этом случае очень легко
            не заметить подмены значений идентификаторов.</p>
          <p>Однако можно изменить имя идентификатора из модуля на какое угодно:</p>
          <pre><code class="python">>>> from math import pi as P
>>> P
3.141592653589793
>>> pi
3.14</code></pre>
          <p>В данном случае константа pi из модуля импортируется под именем P. Смысл подобных
            импортов в сокращении имен, так как есть модули с длинными именами, а имена функций и
            классов в них еще длиннее. Если в программу импортируется всего пара сущностей, и они
            используются в ней часто, то имеет смысл переименовать их на более короткий вариант.
            Сравните:</p>
          <pre><code class="python">>>> import calendar
>>> calendar.weekheader(2)
'Mo Tu We Th Fr Sa Su'</code></pre>
          <p>и</p>
          <pre><code class="python">>>> from calendar import weekheader as week
>>> week(3)
'Mon Tue Wed Thu Fri Sat Sun'</code></pre>
          <p>Во всех остальных случаях лучше оставлять идентификаторы содержимого модуля в
            пространстве имен самого модуля и получать доступ к ним через имя модуля, т. е. выполнять
            импорт командой import имя_модуля, а вызывать, например, функции через
            имя_модуля.имя_функции().</p>
        </div> 
      </section>
    </div>
  </div>
</template>
<script>
export default {
  name: "theory_14"
}
</script>

