<template>
  <main class="page">
    <section class="page__beginpage beginpage">
      <div class="beginpage__container">
        <div class="beginpage__title title-beginpage">
          <h1 class="title-beginpage__title">Справка</h1>

        </div>
      </div>
    </section>
    <section class="page__manual manual">
      <div class="manual__container">
        <div class="manual__content">
          <div class="manual__list list-manual">
            <div class="manual__text text-manual">
              <div class="text-manual__header">
                <h1 class="text-manual__title">Справка</h1>
              </div>
              <div class="text-manual__body">
                <div class="text-manual__content">
                  <section class="text-manual__doc-section">
                    <div class="text-manual__section-block">
                      <p>
                        Методические рекомендации составлены в соответствии с ФГОС СПО
                        по специальности 09.02.01 Компьютерные системы и комплексы.
                      </p>
                      <p>
                        В основе материалов, необходимых для выполнения практических
                        работ, положены требования работодателей к умению и практическому опыту,
                        реализуемому в процессе освоения учебной дисциплины ОП.09 Основы
                        алгоритмизации и программирования, а также требования подготовки кадров
                        по стандартам Worldskills.
                      </p>
                      <p>
                        Изучение данной дисциплины базируется на знаниях, полученных при
                        изучении дисциплины «Информатика».
                        Целью изучения дисциплины является формирование умений студентов
                        применять компьютерную технику и программное обеспечение в
                        профессиональной деятельности, а также следующих общих и
                        профессиональных компетенций:
                      </p>
                      <ul>
                        <li>ОК 1. Понимать сущность и социальную значимость своей будущей 
                          профессии, проявлять к ней устойчивый интерес.</li>
                        <li>ОК 2. Организовывать собственную деятельность, выбирать типовые 
                          методы и способы выполнения профессиональных задач, оценивать их 
                          эффективность и качество.</li>
                        <li>ОК 3. Принимать решения в стандартных и нестандартных ситуациях и 
                          нести за них ответственность.</li>
                        <li>ОК 4. Осуществлять поиск и использование информации, необходимой 
                          для эффективного выполнения профессиональных задач, профессионального 
                          и личностного развития.</li>
                        <li>ОК 5. Использовать информационно-коммуникационные технологии в 
                          профессиональной деятельности.</li>
                        <li>ОК 6. Работать в коллективе и команде, эффективно общаться с 
                          коллегами, руководством, потребителями.</li>
                        <li>ОК 7. Брать на себя ответственность за работу членов команды 
                          (подчиненных), результат выполнения заданий.</li>
                        <li>ОК 8. Самостоятельно определять задачи профессионального и 
                          личностного развития, заниматься самообразованием, осознанно планировать 
                          повышение квалификации.</li>
                        <li>ОК 9. Ориентироваться в условиях частой смены технологий в 
                          профессиональной деятельности.</li>
                        <li>ПК 2.1. Создавать программы на языке ассемблера для 
                          микропроцессорных систем.</li>
                        <li>ПК 2.2. Производить тестирование и отладку микропроцессорных 
                          систем.</li>
                        <li>ПК 2.3. Осуществлять установку и конфигурирование персональных 
                          компьютеров и подключение периферийных устройств.
                          Обобщенные требования к студентам при подготовке к выполнению 
                          практических работ:</li>
                      </ul>
                      <ul>
                        <li>быть теоретически и практически подготовленными для выполнения 
                          работ по учебной дисциплине Основы алгоритмизации и 
                          программирования;</li>
                        <li>выполнять задания практических занятий и предоставлять результаты
                          для контроля преподавателю по завершению занятия.
                          В результате изучения данной дисциплины обучающийся должен 
                          уметь:</li>
                      </ul>
                      <div class="textcols-item">
                        <ol>
                          <li>Формализовать поставленную задачу;</li>
                          <li>Применять полученные знания к различным предметным областям;</li>
                          <li>Составлять и оформлять программы на языках программирования;</li>
                          <li>Тестировать и отлаживать программы;</li>
                        </ol>
                      </div>
                      <p>знать:</p>
                      <div class="textcols-item">
                        <ol>
                          <li>Общие принципы построения и использования языков 
                            программирования, их классификацию;</li>
                          <li>Современные интегрированные среды разработки программ;</li>
                          <li>Процесс создания программ;</li>
                          <li>Стандарты языков программирования;</li>
                          <li>Общую характеристику языков ассемблера: назначение, принципы 
                            построения и использования</li>
                        </ol>
                      </div>
                      <p>Нормы выставления оценок:</p>
                      <ul>
                        <li>оценка «отлично» выставляется при безошибочном, 100%-ом 
                          выполнении заданий;</li>
                        <li>оценка «хорошо» выставляется при правильном 75-90%-ом выполнении 
                          заданий с незначительными замечаниями;</li>
                        <li>оценка «удовлетворительно» выставляется при правильном 60-75%-ом 
                          выполнении задания с незначительными замечаниями;</li>
                        <li>оценка «неудовлетворительно» выставляется при 50%-ом выполнении 
                          указанных заданий.</li>
                      </ul>
                      <p>
                        Студент, не выполнивший, в срок практическую работу обязан 
                        выполнить ее к следующему учебному занятию самостоятельно. На 
                        выполнение практических работ отводится 40 академических часов
                      </p>
                    </div>
                  </section>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </section>
  </main>
</template>

<script>
export default {
  name: "Help",
}
</script>
